# S = {100, 55,1,1,1,1,2,3}
# print(S)

# K = {5,6,7}
# K.add(1)
# print(K)

# A = {0,2,4,6,8}
# B = {1,2,3,4,5}

# print("합집합: ", A|B)
# print("교집합: ", A&B)
# print("차집합: ", A-B)
# print("대칭차집합: ", A^B)

# #딕셔너리: key값과 value값이 한 쌍으로 저장되는 타입
# d = {}
# d = dict()
# d = {
#     "바나나":"외떡잎식물 생각목 파초과 바나나속에 속하는 식물의 총칭",
#     "아이언맨":"여심을 사로잡는 매력적인 미소의 백만장자 플레이보이 토니 스타크",
#     123:456,    #마지막 컴마는 무시합니다.
# }

# #모두 같은 dict를 만듭니다.
# d1 = {"one":1, "two":2, "tree":3}
# d2 = dict({"tree":3, "one":1, "two":2})
# d3 = dict({"one":1, "three":3}, "two":2)
# d4 = dict(one=1, two=2, tree=3)

# #튜플의 리스트
# d5 = dict([("two",2), ("one,1"), ("three",3)])

# #zip의 기능을 추측해 보세요
# d6 = dict(zip(["one", "two", "tree"],[1,2,3]))


# #키가 중복될 경우에는 마지막 하나만 남습니다.
# d = {
#     "캡틴":"Captain",
#     "캡틴":"아메리카",
# }
# print(d)

# d1 = {
#     "A":65,
#     "B":66,
#     "C":67,
# }
# print(d1["B"])